function z = potential(NumKnot1,NumKnot2,x,y,L1,L2) %плотность распределения заряда
for j=1:NumKnot2+1
    for i=1:NumKnot1+1
        %буква П
        if(x(i)>=0.2*L1)&&(x(i)<=0.4*L1)&&(y(j)>=0.083*L2)&&(y(j)<=0.917*L2)||(x(i)>=0.4*L1)&&(x(i)<=0.6*L1)&&(y(j)>=0.700*L2)&&(y(j)<=0.910*L2)||(x(i)>=0.6*L1)&&(x(i)<=0.8*L1)&&(y(j)>=0.083*L2)&&(y(j)<=0.917*L2)
        %буква Н
        %if(x(i)>=0.2*L1)&&(x(i)<=0.4*L1)&&(y(j)>=0.083*L2)&&(y(j)<=0.917*L2)||(x(i)>=0.4*L1)&&(x(i)<=0.6*L1)&&(y(j)>=0.417*L2)&&(y(j)<=0.583*L2)||(x(i)>=0.6*L1)&&(x(i)<=0.8*L1)&&(y(j)>=0.083*L2)&&(y(j)<=0.917*L2)
            z(i,j)=1000;
        else
            z(i,j)=-1000;
        end  
    end
end


